Revit 2027 API
ExternalDataManagerCommand Class
 Represents the commands that an IExternalDataManagerServer supports.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ExternalDataManagerCommand
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalDataManagerCommand : IDisposable
Public Class ExternalDataManagerCommand
	Implements IDisposable
public ref class ExternalDataManagerCommand : IDisposable
type ExternalDataManagerCommand =
    class
        interface IDisposable
    end
The ExternalDataManagerCommand type exposes the following members.
Constructors
Name | Description
ExternalDataManagerCommand(ExternalDataManagerCommand) |  Create a copy of the object.
ExternalDataManagerCommand(ExternalDataManagerCommandId) |  Constructor
Top
Properties
Name | Description
Executable |  Indicates if the command is executable.
Id |  The id of the command.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the command.
SupportMultiItems |  Indicates if the command support manipulate multiple items in one execution.
Tooltip |  The tooltip of the command.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ExternalDataManagerCommand
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
RegisterCommand |  Registers a command.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 Represents the commands that a IExternalDataManagerServer supports.
See Also
Reference
Autodesk.Revit.UI Namespace